###############################################################
#  Generated by:      Cadence Innovus 21.17-s075_1
#  OS:                Linux x86_64(Host ID pc-klas2-9.esat.kuleuven.be)
#  Generated on:      Thu May  8 12:22:31 2025
#  Design:            sparc_exu_alu
#  Command:           saveDesign ../DesignDataIn/dbs/place.enc
###############################################################
current_design sparc_exu_alu
create_clock [get_ports {rclk}]  -name RCLK -period 4.000000 -waveform {0.000000 2.000000}
set_clock_transition  -rise -min 0.04 [get_clocks {RCLK}]
set_clock_transition  -rise -max 0.04 [get_clocks {RCLK}]
set_clock_transition  -fall -min 0.04 [get_clocks {RCLK}]
set_clock_transition  -fall -max 0.04 [get_clocks {RCLK}]
set_input_transition 0.2  [get_ports {cen}]
set_input_transition 0.2  [get_ports {naddsub_on}]
set_input_transition 0.2  [get_ports {rclk}]
set_input_transition 0.2  [get_ports {se}]
set_input_transition 0.2  [get_ports {si}]
set_input_transition 0.2  [get_ports {byp_alu_rs1_data_e[63]}]
set_input_transition 0.2  [get_ports {byp_alu_rs1_data_e[62]}]
set_input_transition 0.2  [get_ports {byp_alu_rs1_data_e[61]}]
set_input_transition 0.2  [get_ports {byp_alu_rs1_data_e[60]}]
set_input_transition 0.2  [get_ports {byp_alu_rs1_data_e[59]}]
set_input_transition 0.2  [get_ports {byp_alu_rs1_data_e[58]}]
set_input_transition 0.2  [get_ports {byp_alu_rs1_data_e[57]}]
set_input_transition 0.2  [get_ports {byp_alu_rs1_data_e[56]}]
set_input_transition 0.2  [get_ports {byp_alu_rs1_data_e[55]}]
set_input_transition 0.2  [get_ports {byp_alu_rs1_data_e[54]}]
set_input_transition 0.2  [get_ports {byp_alu_rs1_data_e[53]}]
set_input_transition 0.2  [get_ports {byp_alu_rs1_data_e[52]}]
set_input_transition 0.2  [get_ports {byp_alu_rs1_data_e[51]}]
set_input_transition 0.2  [get_ports {byp_alu_rs1_data_e[50]}]
set_input_transition 0.2  [get_ports {byp_alu_rs1_data_e[49]}]
set_input_transition 0.2  [get_ports {byp_alu_rs1_data_e[48]}]
set_input_transition 0.2  [get_ports {byp_alu_rs1_data_e[47]}]
set_input_transition 0.2  [get_ports {byp_alu_rs1_data_e[46]}]
set_input_transition 0.2  [get_ports {byp_alu_rs1_data_e[45]}]
set_input_transition 0.2  [get_ports {byp_alu_rs1_data_e[44]}]
set_input_transition 0.2  [get_ports {byp_alu_rs1_data_e[43]}]
set_input_transition 0.2  [get_ports {byp_alu_rs1_data_e[42]}]
set_input_transition 0.2  [get_ports {byp_alu_rs1_data_e[41]}]
set_input_transition 0.2  [get_ports {byp_alu_rs1_data_e[40]}]
set_input_transition 0.2  [get_ports {byp_alu_rs1_data_e[39]}]
set_input_transition 0.2  [get_ports {byp_alu_rs1_data_e[38]}]
set_input_transition 0.2  [get_ports {byp_alu_rs1_data_e[37]}]
set_input_transition 0.2  [get_ports {byp_alu_rs1_data_e[36]}]
set_input_transition 0.2  [get_ports {byp_alu_rs1_data_e[35]}]
set_input_transition 0.2  [get_ports {byp_alu_rs1_data_e[34]}]
set_input_transition 0.2  [get_ports {byp_alu_rs1_data_e[33]}]
set_input_transition 0.2  [get_ports {byp_alu_rs1_data_e[32]}]
set_input_transition 0.2  [get_ports {byp_alu_rs1_data_e[31]}]
set_input_transition 0.2  [get_ports {byp_alu_rs1_data_e[30]}]
set_input_transition 0.2  [get_ports {byp_alu_rs1_data_e[29]}]
set_input_transition 0.2  [get_ports {byp_alu_rs1_data_e[28]}]
set_input_transition 0.2  [get_ports {byp_alu_rs1_data_e[27]}]
set_input_transition 0.2  [get_ports {byp_alu_rs1_data_e[26]}]
set_input_transition 0.2  [get_ports {byp_alu_rs1_data_e[25]}]
set_input_transition 0.2  [get_ports {byp_alu_rs1_data_e[24]}]
set_input_transition 0.2  [get_ports {byp_alu_rs1_data_e[23]}]
set_input_transition 0.2  [get_ports {byp_alu_rs1_data_e[22]}]
set_input_transition 0.2  [get_ports {byp_alu_rs1_data_e[21]}]
set_input_transition 0.2  [get_ports {byp_alu_rs1_data_e[20]}]
set_input_transition 0.2  [get_ports {byp_alu_rs1_data_e[19]}]
set_input_transition 0.2  [get_ports {byp_alu_rs1_data_e[18]}]
set_input_transition 0.2  [get_ports {byp_alu_rs1_data_e[17]}]
set_input_transition 0.2  [get_ports {byp_alu_rs1_data_e[16]}]
set_input_transition 0.2  [get_ports {byp_alu_rs1_data_e[15]}]
set_input_transition 0.2  [get_ports {byp_alu_rs1_data_e[14]}]
set_input_transition 0.2  [get_ports {byp_alu_rs1_data_e[13]}]
set_input_transition 0.2  [get_ports {byp_alu_rs1_data_e[12]}]
set_input_transition 0.2  [get_ports {byp_alu_rs1_data_e[11]}]
set_input_transition 0.2  [get_ports {byp_alu_rs1_data_e[10]}]
set_input_transition 0.2  [get_ports {byp_alu_rs1_data_e[9]}]
set_input_transition 0.2  [get_ports {byp_alu_rs1_data_e[8]}]
set_input_transition 0.2  [get_ports {byp_alu_rs1_data_e[7]}]
set_input_transition 0.2  [get_ports {byp_alu_rs1_data_e[6]}]
set_input_transition 0.2  [get_ports {byp_alu_rs1_data_e[5]}]
set_input_transition 0.2  [get_ports {byp_alu_rs1_data_e[4]}]
set_input_transition 0.2  [get_ports {byp_alu_rs1_data_e[3]}]
set_input_transition 0.2  [get_ports {byp_alu_rs1_data_e[2]}]
set_input_transition 0.2  [get_ports {byp_alu_rs1_data_e[1]}]
set_input_transition 0.2  [get_ports {byp_alu_rs1_data_e[0]}]
set_input_transition 0.2  [get_ports {byp_alu_rs2_data_e_l[63]}]
set_input_transition 0.2  [get_ports {byp_alu_rs2_data_e_l[62]}]
set_input_transition 0.2  [get_ports {byp_alu_rs2_data_e_l[61]}]
set_input_transition 0.2  [get_ports {byp_alu_rs2_data_e_l[60]}]
set_input_transition 0.2  [get_ports {byp_alu_rs2_data_e_l[59]}]
set_input_transition 0.2  [get_ports {byp_alu_rs2_data_e_l[58]}]
set_input_transition 0.2  [get_ports {byp_alu_rs2_data_e_l[57]}]
set_input_transition 0.2  [get_ports {byp_alu_rs2_data_e_l[56]}]
set_input_transition 0.2  [get_ports {byp_alu_rs2_data_e_l[55]}]
set_input_transition 0.2  [get_ports {byp_alu_rs2_data_e_l[54]}]
set_input_transition 0.2  [get_ports {byp_alu_rs2_data_e_l[53]}]
set_input_transition 0.2  [get_ports {byp_alu_rs2_data_e_l[52]}]
set_input_transition 0.2  [get_ports {byp_alu_rs2_data_e_l[51]}]
set_input_transition 0.2  [get_ports {byp_alu_rs2_data_e_l[50]}]
set_input_transition 0.2  [get_ports {byp_alu_rs2_data_e_l[49]}]
set_input_transition 0.2  [get_ports {byp_alu_rs2_data_e_l[48]}]
set_input_transition 0.2  [get_ports {byp_alu_rs2_data_e_l[47]}]
set_input_transition 0.2  [get_ports {byp_alu_rs2_data_e_l[46]}]
set_input_transition 0.2  [get_ports {byp_alu_rs2_data_e_l[45]}]
set_input_transition 0.2  [get_ports {byp_alu_rs2_data_e_l[44]}]
set_input_transition 0.2  [get_ports {byp_alu_rs2_data_e_l[43]}]
set_input_transition 0.2  [get_ports {byp_alu_rs2_data_e_l[42]}]
set_input_transition 0.2  [get_ports {byp_alu_rs2_data_e_l[41]}]
set_input_transition 0.2  [get_ports {byp_alu_rs2_data_e_l[40]}]
set_input_transition 0.2  [get_ports {byp_alu_rs2_data_e_l[39]}]
set_input_transition 0.2  [get_ports {byp_alu_rs2_data_e_l[38]}]
set_input_transition 0.2  [get_ports {byp_alu_rs2_data_e_l[37]}]
set_input_transition 0.2  [get_ports {byp_alu_rs2_data_e_l[36]}]
set_input_transition 0.2  [get_ports {byp_alu_rs2_data_e_l[35]}]
set_input_transition 0.2  [get_ports {byp_alu_rs2_data_e_l[34]}]
set_input_transition 0.2  [get_ports {byp_alu_rs2_data_e_l[33]}]
set_input_transition 0.2  [get_ports {byp_alu_rs2_data_e_l[32]}]
set_input_transition 0.2  [get_ports {byp_alu_rs2_data_e_l[31]}]
set_input_transition 0.2  [get_ports {byp_alu_rs2_data_e_l[30]}]
set_input_transition 0.2  [get_ports {byp_alu_rs2_data_e_l[29]}]
set_input_transition 0.2  [get_ports {byp_alu_rs2_data_e_l[28]}]
set_input_transition 0.2  [get_ports {byp_alu_rs2_data_e_l[27]}]
set_input_transition 0.2  [get_ports {byp_alu_rs2_data_e_l[26]}]
set_input_transition 0.2  [get_ports {byp_alu_rs2_data_e_l[25]}]
set_input_transition 0.2  [get_ports {byp_alu_rs2_data_e_l[24]}]
set_input_transition 0.2  [get_ports {byp_alu_rs2_data_e_l[23]}]
set_input_transition 0.2  [get_ports {byp_alu_rs2_data_e_l[22]}]
set_input_transition 0.2  [get_ports {byp_alu_rs2_data_e_l[21]}]
set_input_transition 0.2  [get_ports {byp_alu_rs2_data_e_l[20]}]
set_input_transition 0.2  [get_ports {byp_alu_rs2_data_e_l[19]}]
set_input_transition 0.2  [get_ports {byp_alu_rs2_data_e_l[18]}]
set_input_transition 0.2  [get_ports {byp_alu_rs2_data_e_l[17]}]
set_input_transition 0.2  [get_ports {byp_alu_rs2_data_e_l[16]}]
set_input_transition 0.2  [get_ports {byp_alu_rs2_data_e_l[15]}]
set_input_transition 0.2  [get_ports {byp_alu_rs2_data_e_l[14]}]
set_input_transition 0.2  [get_ports {byp_alu_rs2_data_e_l[13]}]
set_input_transition 0.2  [get_ports {byp_alu_rs2_data_e_l[12]}]
set_input_transition 0.2  [get_ports {byp_alu_rs2_data_e_l[11]}]
set_input_transition 0.2  [get_ports {byp_alu_rs2_data_e_l[10]}]
set_input_transition 0.2  [get_ports {byp_alu_rs2_data_e_l[9]}]
set_input_transition 0.2  [get_ports {byp_alu_rs2_data_e_l[8]}]
set_input_transition 0.2  [get_ports {byp_alu_rs2_data_e_l[7]}]
set_input_transition 0.2  [get_ports {byp_alu_rs2_data_e_l[6]}]
set_input_transition 0.2  [get_ports {byp_alu_rs2_data_e_l[5]}]
set_input_transition 0.2  [get_ports {byp_alu_rs2_data_e_l[4]}]
set_input_transition 0.2  [get_ports {byp_alu_rs2_data_e_l[3]}]
set_input_transition 0.2  [get_ports {byp_alu_rs2_data_e_l[2]}]
set_input_transition 0.2  [get_ports {byp_alu_rs2_data_e_l[1]}]
set_input_transition 0.2  [get_ports {byp_alu_rs2_data_e_l[0]}]
set_input_transition 0.2  [get_ports {byp_alu_rs3_data_e[63]}]
set_input_transition 0.2  [get_ports {byp_alu_rs3_data_e[62]}]
set_input_transition 0.2  [get_ports {byp_alu_rs3_data_e[61]}]
set_input_transition 0.2  [get_ports {byp_alu_rs3_data_e[60]}]
set_input_transition 0.2  [get_ports {byp_alu_rs3_data_e[59]}]
set_input_transition 0.2  [get_ports {byp_alu_rs3_data_e[58]}]
set_input_transition 0.2  [get_ports {byp_alu_rs3_data_e[57]}]
set_input_transition 0.2  [get_ports {byp_alu_rs3_data_e[56]}]
set_input_transition 0.2  [get_ports {byp_alu_rs3_data_e[55]}]
set_input_transition 0.2  [get_ports {byp_alu_rs3_data_e[54]}]
set_input_transition 0.2  [get_ports {byp_alu_rs3_data_e[53]}]
set_input_transition 0.2  [get_ports {byp_alu_rs3_data_e[52]}]
set_input_transition 0.2  [get_ports {byp_alu_rs3_data_e[51]}]
set_input_transition 0.2  [get_ports {byp_alu_rs3_data_e[50]}]
set_input_transition 0.2  [get_ports {byp_alu_rs3_data_e[49]}]
set_input_transition 0.2  [get_ports {byp_alu_rs3_data_e[48]}]
set_input_transition 0.2  [get_ports {byp_alu_rs3_data_e[47]}]
set_input_transition 0.2  [get_ports {byp_alu_rs3_data_e[46]}]
set_input_transition 0.2  [get_ports {byp_alu_rs3_data_e[45]}]
set_input_transition 0.2  [get_ports {byp_alu_rs3_data_e[44]}]
set_input_transition 0.2  [get_ports {byp_alu_rs3_data_e[43]}]
set_input_transition 0.2  [get_ports {byp_alu_rs3_data_e[42]}]
set_input_transition 0.2  [get_ports {byp_alu_rs3_data_e[41]}]
set_input_transition 0.2  [get_ports {byp_alu_rs3_data_e[40]}]
set_input_transition 0.2  [get_ports {byp_alu_rs3_data_e[39]}]
set_input_transition 0.2  [get_ports {byp_alu_rs3_data_e[38]}]
set_input_transition 0.2  [get_ports {byp_alu_rs3_data_e[37]}]
set_input_transition 0.2  [get_ports {byp_alu_rs3_data_e[36]}]
set_input_transition 0.2  [get_ports {byp_alu_rs3_data_e[35]}]
set_input_transition 0.2  [get_ports {byp_alu_rs3_data_e[34]}]
set_input_transition 0.2  [get_ports {byp_alu_rs3_data_e[33]}]
set_input_transition 0.2  [get_ports {byp_alu_rs3_data_e[32]}]
set_input_transition 0.2  [get_ports {byp_alu_rs3_data_e[31]}]
set_input_transition 0.2  [get_ports {byp_alu_rs3_data_e[30]}]
set_input_transition 0.2  [get_ports {byp_alu_rs3_data_e[29]}]
set_input_transition 0.2  [get_ports {byp_alu_rs3_data_e[28]}]
set_input_transition 0.2  [get_ports {byp_alu_rs3_data_e[27]}]
set_input_transition 0.2  [get_ports {byp_alu_rs3_data_e[26]}]
set_input_transition 0.2  [get_ports {byp_alu_rs3_data_e[25]}]
set_input_transition 0.2  [get_ports {byp_alu_rs3_data_e[24]}]
set_input_transition 0.2  [get_ports {byp_alu_rs3_data_e[23]}]
set_input_transition 0.2  [get_ports {byp_alu_rs3_data_e[22]}]
set_input_transition 0.2  [get_ports {byp_alu_rs3_data_e[21]}]
set_input_transition 0.2  [get_ports {byp_alu_rs3_data_e[20]}]
set_input_transition 0.2  [get_ports {byp_alu_rs3_data_e[19]}]
set_input_transition 0.2  [get_ports {byp_alu_rs3_data_e[18]}]
set_input_transition 0.2  [get_ports {byp_alu_rs3_data_e[17]}]
set_input_transition 0.2  [get_ports {byp_alu_rs3_data_e[16]}]
set_input_transition 0.2  [get_ports {byp_alu_rs3_data_e[15]}]
set_input_transition 0.2  [get_ports {byp_alu_rs3_data_e[14]}]
set_input_transition 0.2  [get_ports {byp_alu_rs3_data_e[13]}]
set_input_transition 0.2  [get_ports {byp_alu_rs3_data_e[12]}]
set_input_transition 0.2  [get_ports {byp_alu_rs3_data_e[11]}]
set_input_transition 0.2  [get_ports {byp_alu_rs3_data_e[10]}]
set_input_transition 0.2  [get_ports {byp_alu_rs3_data_e[9]}]
set_input_transition 0.2  [get_ports {byp_alu_rs3_data_e[8]}]
set_input_transition 0.2  [get_ports {byp_alu_rs3_data_e[7]}]
set_input_transition 0.2  [get_ports {byp_alu_rs3_data_e[6]}]
set_input_transition 0.2  [get_ports {byp_alu_rs3_data_e[5]}]
set_input_transition 0.2  [get_ports {byp_alu_rs3_data_e[4]}]
set_input_transition 0.2  [get_ports {byp_alu_rs3_data_e[3]}]
set_input_transition 0.2  [get_ports {byp_alu_rs3_data_e[2]}]
set_input_transition 0.2  [get_ports {byp_alu_rs3_data_e[1]}]
set_input_transition 0.2  [get_ports {byp_alu_rs3_data_e[0]}]
set_input_transition 0.2  [get_ports {byp_alu_rcc_data_e[63]}]
set_input_transition 0.2  [get_ports {byp_alu_rcc_data_e[62]}]
set_input_transition 0.2  [get_ports {byp_alu_rcc_data_e[61]}]
set_input_transition 0.2  [get_ports {byp_alu_rcc_data_e[60]}]
set_input_transition 0.2  [get_ports {byp_alu_rcc_data_e[59]}]
set_input_transition 0.2  [get_ports {byp_alu_rcc_data_e[58]}]
set_input_transition 0.2  [get_ports {byp_alu_rcc_data_e[57]}]
set_input_transition 0.2  [get_ports {byp_alu_rcc_data_e[56]}]
set_input_transition 0.2  [get_ports {byp_alu_rcc_data_e[55]}]
set_input_transition 0.2  [get_ports {byp_alu_rcc_data_e[54]}]
set_input_transition 0.2  [get_ports {byp_alu_rcc_data_e[53]}]
set_input_transition 0.2  [get_ports {byp_alu_rcc_data_e[52]}]
set_input_transition 0.2  [get_ports {byp_alu_rcc_data_e[51]}]
set_input_transition 0.2  [get_ports {byp_alu_rcc_data_e[50]}]
set_input_transition 0.2  [get_ports {byp_alu_rcc_data_e[49]}]
set_input_transition 0.2  [get_ports {byp_alu_rcc_data_e[48]}]
set_input_transition 0.2  [get_ports {byp_alu_rcc_data_e[47]}]
set_input_transition 0.2  [get_ports {byp_alu_rcc_data_e[46]}]
set_input_transition 0.2  [get_ports {byp_alu_rcc_data_e[45]}]
set_input_transition 0.2  [get_ports {byp_alu_rcc_data_e[44]}]
set_input_transition 0.2  [get_ports {byp_alu_rcc_data_e[43]}]
set_input_transition 0.2  [get_ports {byp_alu_rcc_data_e[42]}]
set_input_transition 0.2  [get_ports {byp_alu_rcc_data_e[41]}]
set_input_transition 0.2  [get_ports {byp_alu_rcc_data_e[40]}]
set_input_transition 0.2  [get_ports {byp_alu_rcc_data_e[39]}]
set_input_transition 0.2  [get_ports {byp_alu_rcc_data_e[38]}]
set_input_transition 0.2  [get_ports {byp_alu_rcc_data_e[37]}]
set_input_transition 0.2  [get_ports {byp_alu_rcc_data_e[36]}]
set_input_transition 0.2  [get_ports {byp_alu_rcc_data_e[35]}]
set_input_transition 0.2  [get_ports {byp_alu_rcc_data_e[34]}]
set_input_transition 0.2  [get_ports {byp_alu_rcc_data_e[33]}]
set_input_transition 0.2  [get_ports {byp_alu_rcc_data_e[32]}]
set_input_transition 0.2  [get_ports {byp_alu_rcc_data_e[31]}]
set_input_transition 0.2  [get_ports {byp_alu_rcc_data_e[30]}]
set_input_transition 0.2  [get_ports {byp_alu_rcc_data_e[29]}]
set_input_transition 0.2  [get_ports {byp_alu_rcc_data_e[28]}]
set_input_transition 0.2  [get_ports {byp_alu_rcc_data_e[27]}]
set_input_transition 0.2  [get_ports {byp_alu_rcc_data_e[26]}]
set_input_transition 0.2  [get_ports {byp_alu_rcc_data_e[25]}]
set_input_transition 0.2  [get_ports {byp_alu_rcc_data_e[24]}]
set_input_transition 0.2  [get_ports {byp_alu_rcc_data_e[23]}]
set_input_transition 0.2  [get_ports {byp_alu_rcc_data_e[22]}]
set_input_transition 0.2  [get_ports {byp_alu_rcc_data_e[21]}]
set_input_transition 0.2  [get_ports {byp_alu_rcc_data_e[20]}]
set_input_transition 0.2  [get_ports {byp_alu_rcc_data_e[19]}]
set_input_transition 0.2  [get_ports {byp_alu_rcc_data_e[18]}]
set_input_transition 0.2  [get_ports {byp_alu_rcc_data_e[17]}]
set_input_transition 0.2  [get_ports {byp_alu_rcc_data_e[16]}]
set_input_transition 0.2  [get_ports {byp_alu_rcc_data_e[15]}]
set_input_transition 0.2  [get_ports {byp_alu_rcc_data_e[14]}]
set_input_transition 0.2  [get_ports {byp_alu_rcc_data_e[13]}]
set_input_transition 0.2  [get_ports {byp_alu_rcc_data_e[12]}]
set_input_transition 0.2  [get_ports {byp_alu_rcc_data_e[11]}]
set_input_transition 0.2  [get_ports {byp_alu_rcc_data_e[10]}]
set_input_transition 0.2  [get_ports {byp_alu_rcc_data_e[9]}]
set_input_transition 0.2  [get_ports {byp_alu_rcc_data_e[8]}]
set_input_transition 0.2  [get_ports {byp_alu_rcc_data_e[7]}]
set_input_transition 0.2  [get_ports {byp_alu_rcc_data_e[6]}]
set_input_transition 0.2  [get_ports {byp_alu_rcc_data_e[5]}]
set_input_transition 0.2  [get_ports {byp_alu_rcc_data_e[4]}]
set_input_transition 0.2  [get_ports {byp_alu_rcc_data_e[3]}]
set_input_transition 0.2  [get_ports {byp_alu_rcc_data_e[2]}]
set_input_transition 0.2  [get_ports {byp_alu_rcc_data_e[1]}]
set_input_transition 0.2  [get_ports {byp_alu_rcc_data_e[0]}]
set_input_transition 0.2  [get_ports {ecl_alu_cin_e}]
set_input_transition 0.2  [get_ports {ifu_exu_invert_d}]
set_input_transition 0.2  [get_ports {ecl_alu_log_sel_and_e}]
set_input_transition 0.2  [get_ports {ecl_alu_log_sel_or_e}]
set_input_transition 0.2  [get_ports {ecl_alu_log_sel_xor_e}]
set_input_transition 0.2  [get_ports {ecl_alu_log_sel_move_e}]
set_input_transition 0.2  [get_ports {ecl_alu_out_sel_sum_e_l}]
set_input_transition 0.2  [get_ports {ecl_alu_out_sel_rs3_e_l}]
set_input_transition 0.2  [get_ports {ecl_alu_out_sel_shift_e_l}]
set_input_transition 0.2  [get_ports {ecl_alu_out_sel_logic_e_l}]
set_input_transition 0.2  [get_ports {shft_alu_shift_out_e[63]}]
set_input_transition 0.2  [get_ports {shft_alu_shift_out_e[62]}]
set_input_transition 0.2  [get_ports {shft_alu_shift_out_e[61]}]
set_input_transition 0.2  [get_ports {shft_alu_shift_out_e[60]}]
set_input_transition 0.2  [get_ports {shft_alu_shift_out_e[59]}]
set_input_transition 0.2  [get_ports {shft_alu_shift_out_e[58]}]
set_input_transition 0.2  [get_ports {shft_alu_shift_out_e[57]}]
set_input_transition 0.2  [get_ports {shft_alu_shift_out_e[56]}]
set_input_transition 0.2  [get_ports {shft_alu_shift_out_e[55]}]
set_input_transition 0.2  [get_ports {shft_alu_shift_out_e[54]}]
set_input_transition 0.2  [get_ports {shft_alu_shift_out_e[53]}]
set_input_transition 0.2  [get_ports {shft_alu_shift_out_e[52]}]
set_input_transition 0.2  [get_ports {shft_alu_shift_out_e[51]}]
set_input_transition 0.2  [get_ports {shft_alu_shift_out_e[50]}]
set_input_transition 0.2  [get_ports {shft_alu_shift_out_e[49]}]
set_input_transition 0.2  [get_ports {shft_alu_shift_out_e[48]}]
set_input_transition 0.2  [get_ports {shft_alu_shift_out_e[47]}]
set_input_transition 0.2  [get_ports {shft_alu_shift_out_e[46]}]
set_input_transition 0.2  [get_ports {shft_alu_shift_out_e[45]}]
set_input_transition 0.2  [get_ports {shft_alu_shift_out_e[44]}]
set_input_transition 0.2  [get_ports {shft_alu_shift_out_e[43]}]
set_input_transition 0.2  [get_ports {shft_alu_shift_out_e[42]}]
set_input_transition 0.2  [get_ports {shft_alu_shift_out_e[41]}]
set_input_transition 0.2  [get_ports {shft_alu_shift_out_e[40]}]
set_input_transition 0.2  [get_ports {shft_alu_shift_out_e[39]}]
set_input_transition 0.2  [get_ports {shft_alu_shift_out_e[38]}]
set_input_transition 0.2  [get_ports {shft_alu_shift_out_e[37]}]
set_input_transition 0.2  [get_ports {shft_alu_shift_out_e[36]}]
set_input_transition 0.2  [get_ports {shft_alu_shift_out_e[35]}]
set_input_transition 0.2  [get_ports {shft_alu_shift_out_e[34]}]
set_input_transition 0.2  [get_ports {shft_alu_shift_out_e[33]}]
set_input_transition 0.2  [get_ports {shft_alu_shift_out_e[32]}]
set_input_transition 0.2  [get_ports {shft_alu_shift_out_e[31]}]
set_input_transition 0.2  [get_ports {shft_alu_shift_out_e[30]}]
set_input_transition 0.2  [get_ports {shft_alu_shift_out_e[29]}]
set_input_transition 0.2  [get_ports {shft_alu_shift_out_e[28]}]
set_input_transition 0.2  [get_ports {shft_alu_shift_out_e[27]}]
set_input_transition 0.2  [get_ports {shft_alu_shift_out_e[26]}]
set_input_transition 0.2  [get_ports {shft_alu_shift_out_e[25]}]
set_input_transition 0.2  [get_ports {shft_alu_shift_out_e[24]}]
set_input_transition 0.2  [get_ports {shft_alu_shift_out_e[23]}]
set_input_transition 0.2  [get_ports {shft_alu_shift_out_e[22]}]
set_input_transition 0.2  [get_ports {shft_alu_shift_out_e[21]}]
set_input_transition 0.2  [get_ports {shft_alu_shift_out_e[20]}]
set_input_transition 0.2  [get_ports {shft_alu_shift_out_e[19]}]
set_input_transition 0.2  [get_ports {shft_alu_shift_out_e[18]}]
set_input_transition 0.2  [get_ports {shft_alu_shift_out_e[17]}]
set_input_transition 0.2  [get_ports {shft_alu_shift_out_e[16]}]
set_input_transition 0.2  [get_ports {shft_alu_shift_out_e[15]}]
set_input_transition 0.2  [get_ports {shft_alu_shift_out_e[14]}]
set_input_transition 0.2  [get_ports {shft_alu_shift_out_e[13]}]
set_input_transition 0.2  [get_ports {shft_alu_shift_out_e[12]}]
set_input_transition 0.2  [get_ports {shft_alu_shift_out_e[11]}]
set_input_transition 0.2  [get_ports {shft_alu_shift_out_e[10]}]
set_input_transition 0.2  [get_ports {shft_alu_shift_out_e[9]}]
set_input_transition 0.2  [get_ports {shft_alu_shift_out_e[8]}]
set_input_transition 0.2  [get_ports {shft_alu_shift_out_e[7]}]
set_input_transition 0.2  [get_ports {shft_alu_shift_out_e[6]}]
set_input_transition 0.2  [get_ports {shft_alu_shift_out_e[5]}]
set_input_transition 0.2  [get_ports {shft_alu_shift_out_e[4]}]
set_input_transition 0.2  [get_ports {shft_alu_shift_out_e[3]}]
set_input_transition 0.2  [get_ports {shft_alu_shift_out_e[2]}]
set_input_transition 0.2  [get_ports {shft_alu_shift_out_e[1]}]
set_input_transition 0.2  [get_ports {shft_alu_shift_out_e[0]}]
set_input_transition 0.2  [get_ports {ecl_alu_sethi_inst_e}]
set_input_transition 0.2  [get_ports {ifu_lsu_casa_e}]
set_input_transition 0.2  [get_ports {npower_on}]
set_input_transition 0.2  [get_ports {nsleep_in}]
set_input_transition 0.2  [get_ports {save}]
set_input_transition 0.2  [get_ports {nrestore}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs2_data_e_l[63]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs2_data_e_l[56]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs2_data_e_l[49]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {shft_alu_shift_out_e[2]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs2_data_e_l[57]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {shft_alu_shift_out_e[3]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs2_data_e_l[58]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {shft_alu_shift_out_e[4]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs2_data_e_l[59]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {shft_alu_shift_out_e[5]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs1_data_e[10]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {ecl_alu_out_sel_rs3_e_l}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {shft_alu_shift_out_e[6]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {ecl_alu_log_sel_or_e}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs1_data_e[11]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {shft_alu_shift_out_e[7]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs1_data_e[12]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {shft_alu_shift_out_e[8]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {ecl_alu_log_sel_and_e}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {shft_alu_shift_out_e[10]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs1_data_e[20]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs1_data_e[13]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {shft_alu_shift_out_e[9]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {ecl_alu_out_sel_shift_e_l}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {shft_alu_shift_out_e[11]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs1_data_e[21]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs1_data_e[14]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {shft_alu_shift_out_e[12]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs1_data_e[22]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs1_data_e[15]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs3_data_e[10]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rcc_data_e[10]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {shft_alu_shift_out_e[20]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {shft_alu_shift_out_e[13]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs1_data_e[30]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs1_data_e[23]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs1_data_e[16]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs3_data_e[11]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rcc_data_e[11]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {npower_on}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {shft_alu_shift_out_e[21]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {shft_alu_shift_out_e[14]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs1_data_e[31]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs1_data_e[24]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs1_data_e[17]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs3_data_e[12]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rcc_data_e[12]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {ifu_lsu_casa_e}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {shft_alu_shift_out_e[22]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {shft_alu_shift_out_e[15]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs1_data_e[32]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs1_data_e[25]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs1_data_e[18]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs3_data_e[20]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs3_data_e[13]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rcc_data_e[20]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rcc_data_e[13]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs2_data_e_l[0]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {shft_alu_shift_out_e[30]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {shft_alu_shift_out_e[23]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {shft_alu_shift_out_e[16]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs1_data_e[40]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs1_data_e[33]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs1_data_e[26]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs1_data_e[19]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs3_data_e[21]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs3_data_e[14]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rcc_data_e[21]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rcc_data_e[14]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs2_data_e_l[1]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {shft_alu_shift_out_e[31]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {shft_alu_shift_out_e[24]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {shft_alu_shift_out_e[17]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs1_data_e[41]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs1_data_e[34]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs1_data_e[27]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {ecl_alu_sethi_inst_e}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs3_data_e[22]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs3_data_e[15]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rcc_data_e[22]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rcc_data_e[15]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs2_data_e_l[2]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {ecl_alu_out_sel_logic_e_l}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {shft_alu_shift_out_e[32]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {shft_alu_shift_out_e[25]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {shft_alu_shift_out_e[18]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs1_data_e[42]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs1_data_e[35]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs1_data_e[28]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs3_data_e[30]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs3_data_e[23]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs3_data_e[16]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rcc_data_e[30]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rcc_data_e[23]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rcc_data_e[16]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs2_data_e_l[3]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {shft_alu_shift_out_e[40]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {shft_alu_shift_out_e[33]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {shft_alu_shift_out_e[26]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {shft_alu_shift_out_e[19]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs1_data_e[50]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs1_data_e[43]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs1_data_e[36]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs1_data_e[29]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs2_data_e_l[10]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs3_data_e[31]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs3_data_e[24]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs3_data_e[17]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rcc_data_e[31]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rcc_data_e[24]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rcc_data_e[17]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {save}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs2_data_e_l[4]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {shft_alu_shift_out_e[41]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {shft_alu_shift_out_e[34]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {shft_alu_shift_out_e[27]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs1_data_e[51]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs1_data_e[44]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs1_data_e[37]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs2_data_e_l[11]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs3_data_e[32]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs3_data_e[25]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs3_data_e[18]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rcc_data_e[32]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rcc_data_e[25]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rcc_data_e[18]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs2_data_e_l[5]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {se}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {shft_alu_shift_out_e[42]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {shft_alu_shift_out_e[35]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {shft_alu_shift_out_e[28]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs1_data_e[52]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs1_data_e[45]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs1_data_e[38]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs2_data_e_l[12]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs3_data_e[40]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs3_data_e[33]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs3_data_e[26]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs3_data_e[19]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rcc_data_e[40]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rcc_data_e[33]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rcc_data_e[26]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rcc_data_e[19]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs2_data_e_l[6]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {shft_alu_shift_out_e[50]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {shft_alu_shift_out_e[43]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {shft_alu_shift_out_e[36]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {shft_alu_shift_out_e[29]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs1_data_e[60]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs1_data_e[53]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs1_data_e[46]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs1_data_e[39]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {si}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs2_data_e_l[20]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs2_data_e_l[13]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs3_data_e[41]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs3_data_e[34]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs3_data_e[27]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rcc_data_e[41]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rcc_data_e[34]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rcc_data_e[27]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs2_data_e_l[7]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {naddsub_on}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {shft_alu_shift_out_e[51]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {shft_alu_shift_out_e[44]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {shft_alu_shift_out_e[37]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs1_data_e[0]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs1_data_e[61]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs1_data_e[54]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs1_data_e[47]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs2_data_e_l[21]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs2_data_e_l[14]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs3_data_e[42]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs3_data_e[35]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs3_data_e[28]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rcc_data_e[42]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rcc_data_e[35]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rcc_data_e[28]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs2_data_e_l[8]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {ifu_exu_invert_d}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {nsleep_in}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {shft_alu_shift_out_e[52]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {shft_alu_shift_out_e[45]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {shft_alu_shift_out_e[38]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs1_data_e[1]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs1_data_e[62]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs1_data_e[55]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs1_data_e[48]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs2_data_e_l[22]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs2_data_e_l[15]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs3_data_e[50]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs3_data_e[43]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs3_data_e[36]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs3_data_e[29]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rcc_data_e[50]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rcc_data_e[43]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rcc_data_e[36]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rcc_data_e[29]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs2_data_e_l[9]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {ecl_alu_cin_e}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs3_data_e[0]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rcc_data_e[0]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {ecl_alu_log_sel_move_e}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {shft_alu_shift_out_e[60]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {shft_alu_shift_out_e[53]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {shft_alu_shift_out_e[46]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {shft_alu_shift_out_e[39]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs1_data_e[2]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs1_data_e[63]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs1_data_e[56]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs1_data_e[49]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs2_data_e_l[30]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs2_data_e_l[23]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs2_data_e_l[16]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs3_data_e[51]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs3_data_e[44]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs3_data_e[37]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rcc_data_e[51]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rcc_data_e[44]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rcc_data_e[37]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs3_data_e[1]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rcc_data_e[1]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {shft_alu_shift_out_e[61]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {shft_alu_shift_out_e[54]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {shft_alu_shift_out_e[47]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs1_data_e[3]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs1_data_e[57]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs2_data_e_l[31]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs2_data_e_l[24]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs2_data_e_l[17]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs3_data_e[52]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs3_data_e[45]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs3_data_e[38]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rcc_data_e[52]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rcc_data_e[45]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rcc_data_e[38]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs3_data_e[2]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rcc_data_e[2]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {shft_alu_shift_out_e[62]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {shft_alu_shift_out_e[55]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {shft_alu_shift_out_e[48]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs1_data_e[4]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs1_data_e[58]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs2_data_e_l[32]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs2_data_e_l[25]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs2_data_e_l[18]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs3_data_e[60]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs3_data_e[53]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs3_data_e[46]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs3_data_e[39]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rcc_data_e[60]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rcc_data_e[53]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rcc_data_e[46]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rcc_data_e[39]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs3_data_e[3]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rcc_data_e[3]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {shft_alu_shift_out_e[63]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {shft_alu_shift_out_e[56]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {shft_alu_shift_out_e[49]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs1_data_e[5]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs1_data_e[59]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs2_data_e_l[40]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs2_data_e_l[33]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs2_data_e_l[26]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs2_data_e_l[19]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs3_data_e[61]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs3_data_e[54]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs3_data_e[47]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rcc_data_e[61]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rcc_data_e[54]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rcc_data_e[47]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs3_data_e[4]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rcc_data_e[4]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {shft_alu_shift_out_e[57]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs1_data_e[6]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs2_data_e_l[41]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs2_data_e_l[34]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs2_data_e_l[27]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs3_data_e[62]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs3_data_e[55]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs3_data_e[48]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rcc_data_e[62]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rcc_data_e[55]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rcc_data_e[48]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs3_data_e[5]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rcc_data_e[5]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {shft_alu_shift_out_e[58]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs1_data_e[7]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs2_data_e_l[42]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs2_data_e_l[35]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs2_data_e_l[28]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs3_data_e[63]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs3_data_e[56]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs3_data_e[49]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rcc_data_e[63]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rcc_data_e[56]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rcc_data_e[49]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs3_data_e[6]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rcc_data_e[6]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {shft_alu_shift_out_e[59]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs1_data_e[8]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs2_data_e_l[50]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs2_data_e_l[43]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs2_data_e_l[36]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs2_data_e_l[29]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs3_data_e[57]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rcc_data_e[57]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs3_data_e[7]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rcc_data_e[7]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs1_data_e[9]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs2_data_e_l[51]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs2_data_e_l[44]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs2_data_e_l[37]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs3_data_e[58]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rcc_data_e[58]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs3_data_e[8]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rcc_data_e[8]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs2_data_e_l[52]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs2_data_e_l[45]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs2_data_e_l[38]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs3_data_e[59]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rcc_data_e[59]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {ecl_alu_log_sel_xor_e}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {ecl_alu_out_sel_sum_e_l}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {cen}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs3_data_e[9]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rcc_data_e[9]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs2_data_e_l[60]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs2_data_e_l[53]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs2_data_e_l[46]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs2_data_e_l[39]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs2_data_e_l[61]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs2_data_e_l[54]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs2_data_e_l[47]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {shft_alu_shift_out_e[0]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs2_data_e_l[62]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs2_data_e_l[55]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {byp_alu_rs2_data_e_l[48]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {shft_alu_shift_out_e[1]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {exu_mmu_early_va_e[2]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {exu_ifu_brpc_e[6]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {alu_byp_rd_data_e[51]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {alu_byp_rd_data_e[44]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {alu_byp_rd_data_e[37]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {exu_lsu_ldst_va_e[10]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {exu_lsu_ldst_va_e[7]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {exu_mmu_early_va_e[3]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {exu_ifu_brpc_e[7]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {alu_byp_rd_data_e[52]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {alu_byp_rd_data_e[45]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {alu_byp_rd_data_e[38]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {exu_lsu_ldst_va_e[11]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {alu_byp_rd_data_e[0]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {exu_lsu_ldst_va_e[8]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {exu_ifu_brpc_e[10]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {exu_mmu_early_va_e[4]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {exu_ifu_brpc_e[8]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {alu_byp_rd_data_e[60]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {alu_byp_rd_data_e[53]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {alu_byp_rd_data_e[46]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {alu_byp_rd_data_e[39]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {exu_lsu_ldst_va_e[12]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {alu_byp_rd_data_e[1]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {exu_lsu_ldst_va_e[9]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {exu_ifu_brpc_e[11]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {exu_mmu_early_va_e[5]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {exu_ifu_brpc_e[9]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {alu_byp_rd_data_e[61]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {alu_byp_rd_data_e[54]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {alu_byp_rd_data_e[47]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {exu_lsu_ldst_va_e[20]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {exu_lsu_ldst_va_e[13]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {alu_byp_rd_data_e[2]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {exu_ifu_brpc_e[12]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {exu_mmu_early_va_e[6]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {alu_ecl_zlow_e}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {alu_byp_rd_data_e[62]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {alu_byp_rd_data_e[55]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {alu_byp_rd_data_e[48]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {alu_ecl_adderin2_63_e}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {exu_lsu_ldst_va_e[21]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {exu_lsu_ldst_va_e[14]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {alu_byp_rd_data_e[3]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {exu_ifu_brpc_e[20]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {exu_ifu_brpc_e[13]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {exu_mmu_early_va_e[7]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {alu_byp_rd_data_e[63]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {alu_byp_rd_data_e[56]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {alu_byp_rd_data_e[49]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {exu_lsu_ldst_va_e[22]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {exu_lsu_ldst_va_e[15]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {alu_byp_rd_data_e[4]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {exu_ifu_brpc_e[21]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {exu_ifu_brpc_e[14]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {alu_byp_rd_data_e[10]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {alu_ecl_log_n64_e}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {alu_byp_rd_data_e[57]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {exu_lsu_ldst_va_e[30]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {exu_lsu_ldst_va_e[23]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {exu_lsu_ldst_va_e[16]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {alu_byp_rd_data_e[5]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {exu_ifu_brpc_e[22]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {exu_ifu_brpc_e[15]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {alu_byp_rd_data_e[11]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {alu_byp_rd_data_e[58]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {exu_lsu_ldst_va_e[31]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {exu_lsu_ldst_va_e[24]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {exu_lsu_ldst_va_e[17]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {alu_ecl_add_n64_e}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {alu_ecl_mem_addr_invalid_e_l}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {alu_byp_rd_data_e[6]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {exu_ifu_brpc_e[30]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {exu_ifu_brpc_e[23]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {exu_ifu_brpc_e[16]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {alu_byp_rd_data_e[12]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {exu_lsu_early_va_e[3]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {alu_byp_rd_data_e[59]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {exu_lsu_ldst_va_e[32]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {exu_lsu_ldst_va_e[25]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {exu_lsu_ldst_va_e[18]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {alu_ecl_adderin2_31_e}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {alu_byp_rd_data_e[7]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {exu_ifu_brpc_e[31]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {exu_ifu_brpc_e[24]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {exu_ifu_brpc_e[17]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {alu_byp_rd_data_e[20]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {alu_byp_rd_data_e[13]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {exu_lsu_early_va_e[4]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {exu_lsu_ldst_va_e[40]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {exu_lsu_ldst_va_e[33]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {exu_lsu_ldst_va_e[26]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {exu_lsu_ldst_va_e[19]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {exu_ifu_regz_e}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {alu_byp_rd_data_e[8]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {exu_ifu_brpc_e[32]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {exu_ifu_brpc_e[25]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {exu_ifu_brpc_e[18]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {alu_byp_rd_data_e[21]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {alu_byp_rd_data_e[14]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {alu_ecl_cout32_e}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {exu_lsu_early_va_e[5]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {alu_ecl_log_n32_e}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {exu_lsu_ldst_va_e[41]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {exu_lsu_ldst_va_e[34]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {exu_lsu_ldst_va_e[27]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {alu_byp_rd_data_e[9]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {exu_ifu_brpc_e[40]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {exu_ifu_brpc_e[33]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {exu_ifu_brpc_e[26]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {exu_ifu_brpc_e[19]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {alu_byp_rd_data_e[22]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {alu_byp_rd_data_e[15]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {exu_lsu_early_va_e[6]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {alu_ecl_adder_out_63_e}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {exu_lsu_ldst_va_e[42]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {exu_lsu_ldst_va_e[35]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {exu_lsu_ldst_va_e[28]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {alu_ecl_add_n32_e}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {exu_ifu_brpc_e[41]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {exu_ifu_brpc_e[34]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {exu_ifu_brpc_e[27]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {alu_byp_rd_data_e[30]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {alu_byp_rd_data_e[23]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {alu_byp_rd_data_e[16]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {exu_lsu_early_va_e[7]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {exu_lsu_ldst_va_e[0]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {exu_lsu_ldst_va_e[43]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {exu_lsu_ldst_va_e[36]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {exu_lsu_ldst_va_e[29]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {exu_ifu_brpc_e[0]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {exu_ifu_brpc_e[42]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {exu_ifu_brpc_e[35]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {exu_ifu_brpc_e[28]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {alu_byp_rd_data_e[31]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {alu_byp_rd_data_e[24]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {alu_byp_rd_data_e[17]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {exu_lsu_early_va_e[8]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {exu_lsu_ldst_va_e[1]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {exu_lsu_ldst_va_e[44]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {exu_lsu_ldst_va_e[37]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {exu_ifu_brpc_e[1]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {exu_ifu_brpc_e[43]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {exu_ifu_brpc_e[36]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {exu_ifu_brpc_e[29]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {alu_byp_rd_data_e[32]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {alu_byp_rd_data_e[25]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {alu_byp_rd_data_e[18]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {exu_lsu_early_va_e[9]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {exu_lsu_ldst_va_e[2]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {exu_lsu_ldst_va_e[45]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {exu_lsu_ldst_va_e[38]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {exu_ifu_brpc_e[2]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {exu_ifu_brpc_e[44]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {exu_ifu_brpc_e[37]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {alu_byp_rd_data_e[40]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {alu_byp_rd_data_e[33]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {alu_byp_rd_data_e[26]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {alu_byp_rd_data_e[19]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {exu_lsu_ldst_va_e[3]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {exu_lsu_ldst_va_e[46]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {exu_lsu_ldst_va_e[39]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {exu_ifu_brpc_e[3]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {exu_ifu_brpc_e[45]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {exu_ifu_brpc_e[38]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {alu_byp_rd_data_e[41]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {alu_byp_rd_data_e[34]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {alu_byp_rd_data_e[27]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {so}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {exu_lsu_ldst_va_e[4]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {exu_lsu_ldst_va_e[47]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {exu_mmu_early_va_e[0]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {exu_ifu_brpc_e[4]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {exu_lsu_early_va_e[10]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {exu_ifu_brpc_e[46]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {exu_ifu_brpc_e[39]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {alu_byp_rd_data_e[42]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {alu_byp_rd_data_e[35]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {alu_byp_rd_data_e[28]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {exu_lsu_ldst_va_e[5]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {exu_mmu_early_va_e[1]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {exu_ifu_brpc_e[5]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {exu_ifu_brpc_e[47]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {alu_byp_rd_data_e[50]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {alu_byp_rd_data_e[43]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {alu_byp_rd_data_e[36]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {alu_byp_rd_data_e[29]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {RCLK}] [get_ports {exu_lsu_ldst_va_e[6]}]
set_clock_uncertainty 0.05 -hold [get_clocks {RCLK}]
set_clock_uncertainty 0.025 -setup [get_clocks {RCLK}]
